backend/app/controllers/authentication_controller.rb

    def login
        user = User.find_by({ username: params[:username]})
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "mel432"], ["LIMIT", 1]]