Mod4BackEnd/app/controllers/users_controller.rb

    def create
        user = User.create({
            username: params[:username],
            password: params[:password],
            address: params[:address],
            email: params[:email]
        })
---
INSERT INTO "users" ("username", "password_digest", "address", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def show
        # byebug
        @current_user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 41], ["LIMIT", 1]]